app/Http/Controllers/SeasonsController.php

select * from "episodes" where "episodes"."season_id" in (4, 5, 6, 7, 8, 9, 10)
select * from "seasons" where "seasons"."series_id" = 2 and "seasons"."series_id" is not null
---
    public function index(Series $series)
    {
        $seasons = $series->seasons()->with('episodes')->get();