app/Http/Controllers/SeriesController.php

select * from "series"
---
    public function index()
    {
        $series = Series::all();

select * from "seasons" where "seasons"."series_id" = 3 and "seasons"."series_id" is not null
insert into "series" ("name", "updated_at", "created_at") values ('Game of Thrones', '2022-07-26 23:08:19', '2022-07-26 23:08:19') returning "id"
insert into "seasons" ("number", "series_id") values (1, 4), (2, 4), (3, 4), (4, 4), (5, 4), (6, 4), (7, 4)
insert into "episodes" ("number", "season_id") values (1, 14), (2, 14), (3, 14), (4, 14), (5, 14), (6, 14), (1, 15), (2, 15), (3, 15), (4, 15), (5, 15), (6, 15), (1, 16), (2, 16), (3, 16), (4, 16), (5, 16), (6, 16), (1, 17), (2, 17), (3, 17), (4, 17), (5, 17), (6, 17), (1, 18), (2, 18), (3, 18), (4, 18), (5, 18), (6, 18), (1, 19), (2, 19), (3, 19), (4, 19), (5, 19), (6, 19), (1, 20), (2, 20), (3, 20), (4, 20), (5, 20), (6, 20)
select * from "seasons" where "seasons"."series_id" = 4 and "seasons"."series_id" is not null
---
    public function store(SeriesFormRequest $request)
    {
        $series = DB::transaction(function () use ($request)
        {
            $series = Series::create($request->all());

            $seasons = [];
            for($i = 1; $i <= $request->seasonsQty; $i++) {
                $seasons[] = [
                    'series_id' => $series->id,
                    'number' => $i
                ];
            }
            Season::insert($seasons);

            $episodes = [];
            foreach($series->seasons as $season) {
                for($j = 1; $j <= $request->epsPerSeason; $j++) {
                    $episodes[] = [
                        'season_id' => $season->id,
                        'number' => $j
                    ];
                }
            }
            Episode::insert($episodes);

            return $series;
        });

        return to_route('series.index')->with('mensagem.sucesso', "Série '$series->name' adicionada com sucesso.");

delete from "series" where "id" = 2
---
    public function destroy(Series $series)
    {
        $series->delete();